<a href="https://colab.research.google.com/github/sehrish30/pandas-Practice/blob/main/8_Python_101_Python_Libraries_for_Data_Analysis_Pandas_Skeleton.ipynb" target="_parent"><img src="https://colab.research.google.com/assets/colab-badge.svg" alt="Open In Colab"/></a>

# 1. PANDAS BASICS

In [ ]:
# Pandas is a data manipulation and analysis tool that is built on Numpy.
# Pandas uses a data structure known as DataFrame (think of it as Microsoft excel in Python). 
# DataFrames empower programmers to store and manipulate data in a tabular fashion (rows and columns).
# Series Vs. DataFrame? Series is considered a single column of a DataFrame.

In [7]:
import pandas as pd

In [ ]:
# Let's define two lists as shown below:
my_list = ['APPL', 'AMZN', 'T']
my_list

['APPL', 'AMZN', 'T']

In [ ]:
label = ['stock#1', 'stock#2', 'stock#3']
label

['stock#1', 'stock#2', 'stock#3']

In [ ]:
type(label)

list

In [ ]:
type(my_list)

list

In [ ]:
# Let's create a one dimensional Pandas "series" 
# Note that series is formed of data and associated labels 
x_series  = pd.Series(index = label, data = my_list)

In [ ]:
# Let's view the series
x_series

stock#1    APPL
stock#2    AMZN
stock#3       T
dtype: object

In [ ]:
# Let's obtain the datatype
type(x_series)

pandas.core.series.Series

In [ ]:
# Let's define a two-dimensional Pandas DataFrame
# Note that you can create a pandas dataframe from a python dictionary
bank_client_df = pd.DataFrame({'Bank client ID': [111, 222, 333, 444],
                               'Bank Client Name': ['Channel', 'Steve', 'Mitch', 'Ryan'],
                               'Net Worth [$]': [3500, 29000, 10000, 2000],
                               'Years with bank': [3, 4, 9, 5]
                               })
bank_client_df

   Bank client ID Bank Client Name  Net Worth [$]  Years with bank
0             111          Channel           3500                3
1             222            Steve          29000                4
2             333            Mitch          10000                9
3             444             Ryan           2000                5

In [ ]:
# Let's obtain the data type 
type(bank_client_df)

pandas.core.frame.DataFrame

In [ ]:
# you can only view the first couple of rows using .head()
bank_client_df.head(2)

   Bank client ID Bank Client Name  Net Worth [$]  Years with bank
0             111          Channel           3500                3
1             222            Steve          29000                4

In [ ]:
# you can only view the last couple of rows using .tail()
bank_client_df.tail(1)

   Bank client ID Bank Client Name  Net Worth [$]  Years with bank
3             444             Ryan           2000                5

**MINI CHALLENGE #1:**
- **A porfolio contains a collection of securities such as stocks, bonds and ETFs. Define a dataframe named 'portfolio_df' that holds 3 different stock ticker symbols, number of shares, and price per share (feel free to choose any stocks)**
- **Calculate the total value of the porfolio including all stocks**

In [ ]:
portfolio_df = pd.DataFrame({
    'stock ticker symbol': ['AAPL', 'AMZN', 'T'],
    'Number of shares': [3, 4, 9],
    'price per share': [3500, 200, 40]
})
portfolio_df

  stock ticker symbol  Number of shares  price per share
0                AAPL                 3             3500
1                AMZN                 4              200
2                   T                 9               40

In [ ]:
stocks_dollar_value = portfolio_df['Number of shares'] * portfolio_df['price per share']
print(stocks_dollar_value) 
print(f'Total portfolio value {stocks_dollar_value.sum()}')

0    10500
1      800
2      360
dtype: int64
Total portfolio value 11660

# 2. PANDAS WITH CSV AND HTML DATA

In [2]:
# In order to access data on Google Drive, you need to mount the drive to access it's content
from google.colab import drive
drive.mount('/content/drive')

Mounted at /content/drive

In [4]:
# Pandas is used to read a csv file and store data in a DataFrame
bank_df = pd.read_csv('/bank_client_information.csv')

NameError: ignored

In [ ]:
from google.colab import drive
drive.mount('/content/drive')

In [10]:
# pandas is used to read csv file and store data in DataFrame
bank_df = pd.read_csv('/content/drive/MyDrive/bank_client_information.csv')
bank_df

  First Name Last Name              Email Postal Code   Net Worth
0     Joseph    Patton     daafeja@boh.jm     M6U 5U7  $2,629.13
1       Noah     Moran  guutodi@bigwoc.kw     K2D 4M9  $8,626.96
2       Nina    Keller    azikez@gahew.mr     S1T 4E6  $9,072.02

In [11]:
# write to a csv file without an index
bank_df.to_csv('sample_outpt.csv', index = False)

In [12]:
# write to a csv file with an index
bank_df.to_csv('sample_outpt.csv', index = True)

In [18]:
# Read tabular data using read_html
house_prices_df = pd.read_html('https://www.livingin-canada.com/house-prices-canada.html')
house_prices_df[0]

                                                City  ...                                    12 Month Change
0                                      Vancouver, BC  ...                                           + 2.63 %
1                                       Toronto, Ont  ...                                            +10.2 %
2                                        Ottawa, Ont  ...                                           + 15.4 %
3                                       Calgary, Alb  ...                                            – 1.5 %
4                                      Montreal, Que  ...                                            + 9.3 %
5                                        Halifax, NS  ...                                            + 3.6 %
6                                       Regina, Sask  ...                                            – 3.9 %
7                                    Fredericton, NB  ...                                            – 4.3 %
8  (adsbygoogle = window.adsbygoogle || []).push(...  ...  (adsbygoogle = window.adsbygoogle || []).push(...

[9 rows x 3 columns]

**MINI CHALLENGE #2:**
- **Write a code that uses Pandas to read tabular US retirement data**
- **You can use data from here: https://www.ssa.gov/oact/progdata/nra.html**

In [20]:
retirement_data_df = pd.read_html('https://www.ssa.gov/oact/progdata/nra.html')
retirement_data_df

[                                        Year of birth                                                Age
 0                                      1937 and prior                                                 65
 1                                                1938                                    65 and 2 months
 2                                                1939                                    65 and 4 months
 3                                                1940                                    65 and 6 months
 4                                                1941                                    65 and 8 months
 5                                                1942                                   65 and 10 months
 6                                             1943-54                                                 66
 7                                                1955                                    66 and 2 months
 8                                                1956                                    66 and 4 months
 9                                                1957                                    66 and 6 months
 10                                               1958                                    66 and 8 months
 11                                               1959                                   66 and 10 months
 12                                     1960 and later                                                 67
 13  Notes: 1. Persons born on January 1 of any yea...  Notes: 1. Persons born on January 1 of any yea...]

# 3. PANDAS OPERATIONS

In [28]:
# Let's define a dataframe as follows:
bank_client_df = pd.DataFrame({'Bank client ID': [111, 222, 333, 444],
                               'Bank Client Name': ['Channel', 'Steve', 'Mitch', 'Ryan'],
                               'Net Worth [$]': [3500, 29000, 10000, 2000],
                               'Years with bank': [3, 4, 9, 5]
                               })
bank_client_df

   Bank client ID Bank Client Name  Net Worth [$]  Years with bank
0             111          Channel           3500                3
1             222            Steve          29000                4
2             333            Mitch          10000                9
3             444             Ryan           2000                5

In [25]:
# Pick certain rows that satisfy a certain criteria 
df_loyal = bank_client_df[(bank_client_df['Years with bank'] >= 5)]
df_loyal

   Bank client ID Bank Client Name  Net Worth [$]  Years with bank
2             333            Mitch          10000                9
3             444             Ryan           2000                5

In [29]:
# Delete a column from a DataFrame
del bank_client_df['Bank client ID']
bank_client_df

  Bank Client Name  Net Worth [$]  Years with bank
0          Channel           3500                3
1            Steve          29000                4
2            Mitch          10000                9
3             Ryan           2000                5

**MINI CHALLENGE #3:**
- **Using "bank_client_df" DataFrame, leverage pandas operations to only select high networth individuals with minimum $5000** 
- **What is the combined networth for all customers with 5000+ networth?**

In [31]:
df_high = bank_client_df[(bank_client_df['Net Worth [$]'] >= 5000)]
df_high

  Bank Client Name  Net Worth [$]  Years with bank
1            Steve          29000                4
2            Mitch          10000                9

In [32]:
df_high['Net Worth [$]'].sum()

39000

# 4. PANDAS WITH FUNCTIONS

In [ ]:
# Let's define a dataframe as follows:

In [ ]:
# Define a function that increases all clients networth (stocks) by a fixed value of 10% (for simplicity sake)

In [ ]:
# You can apply a function to the DataFrame

**MINI CHALLENGE #4:**
- **Define a function that doubles stock prices and adds $100**
- **Apply the function to the DataFrame**
- **Calculate the updated total networth of all clients combined**

# 5. SORTING AND ORDERING

In [ ]:
# Let's define a dataframe as follows:

In [ ]:
# You can sort the values in the dataframe according to number of years with bank

In [ ]:
# Note that nothing changed in memory! you have to make sure that inplace is set to True

In [ ]:
# Set inplace = True to ensure that change has taken place in memory

In [ ]:
# Note that now the change (ordering) took place

**MINI CHALLENGE #5:**
- **Sort customers by networth instead of years with bank. Make sure to update values in-memory.**

# 6. CONCATENATING AND MERGING WITH PANDAS

Check this out: https://pandas.pydata.org/pandas-docs/stable/user_guide/merging.html

In [ ]:
# Creating a dataframe from a dictionary
# Let's define a dataframe with a list of bank clients with IDs = 1, 2, 3, 4, 5

In [ ]:
# Let's define another dataframe for a separate list of clients (IDs = 6, 7, 8, 9, 10)

In [ ]:
# Let's assume we obtained additional information (Annual Salary) about our bank customers 
# Note that data obtained is for all clients with IDs 1 to 10

In [ ]:
# Let's concatenate both dataframes #1 and #2
# Note that we now have client IDs from 1 to 10

In [ ]:
# Let's merge all data on 'Bank Client ID'

**MINI CHALLENGE #6:**
- **Let's assume that you became a new client to the bank**
- **Define a new DataFrame that contains your information such as client ID (choose 11), first name, last name, and annual salary.**
- **Add this new dataframe to the original dataframe "bank_df_all".**

# EXCELLENT JOB!

# MINI CHALLENGE SOLUTIONS

**MINI CHALLENGE #1 SOLUTION:**
- **A porfolio contains a collection of securities such as stocks, bonds and ETFs. Define a dataframe named 'portfolio_df' that holds 3 different stock ticker symbols, number of shares, and price per share (feel free to choose any stocks)**
- **Calculate the total value of the porfolio including all stocks**

In [ ]:
portfolio_df = pd.DataFrame({'stock ticker symbols':['AAPL', 'AMZN', 'T'],
                             'price per share [$]':[3500, 200, 40], 
                             'Number of stocks':[3, 4, 9]})
portfolio_df

In [ ]:
stocks_dollar_value = portfolio_df['price per share [$]'] * portfolio_df['Number of stocks']
print(stocks_dollar_value)
print('Total portfolio value = {}'.format(stocks_dollar_value.sum()))

**MINI CHALLENGE #2 SOLUTION:**
- **Write a code that uses Pandas to read tabular US retirement data**
- **You can use data from here: https://www.ssa.gov/oact/progdata/nra.html**

In [ ]:
# Read tabular data using read_html
retirement_age_df = pd.read_html('https://www.ssa.gov/oact/progdata/nra.html')
retirement_age_df

**MINI CHALLENGE #3 SOLUTION:**
- **Using "bank_client_df" DataFrame, leverage pandas operations to only select high networth individuals with minimum $5000** 
- **What is the combined networth for all customers with 5000+ networth?**

In [ ]:
df_high_networth = bank_client_df[ (bank_client_df['Net worth [$]'] >= 5000) ]
df_high_networth

In [ ]:
df_high_networth['Net worth [$]'].sum()

**MINI CHALLENGE #4 SOLUTION:**
- **Define a function that doubles stock prices and adds $100**
- **Apply the function to the DataFrame**
- **Calculate the updated total networth of all clients combined**

In [ ]:
def networth_update(balance):
    return balance * 2 + 100 # assume that stock prices increased by 10%

In [ ]:
# You can apply a function to the DataFrame 
results = bank_client_df['Net worth [$]'].apply(networth_update)
results

In [ ]:
results.sum()

**MINI CHALLENGE #5 SOLUTION:**
- **Sort customers by networth instead of years with bank. Make sure to update values in-memory.**

In [ ]:
# You can sort the values in the dataframe according to number of years with bank
bank_client_df.sort_values(by = 'Net worth [$]', inplace = True) 
bank_client_df

**MINI CHALLENGE #6 SOLUTION:**
- **Let's assume that you became a new client to the bank**
- **Define a new DataFrame that contains your information such as client ID (choose 11), first name, last name, and annual salary.**
- **Add this new dataframe to the original dataframe "bank_df_all".**

In [ ]:
new_client = {
        'Bank Client ID': ['11'],
        'First Name': ['Ry'], 
        'Last Name': ['Aly'],
        'Annual Salary [$/year]' : [1000]}
new_client_df = pd.DataFrame(new_client, columns = ['Bank Client ID', 'First Name', 'Last Name', 'Annual Salary [$/year]'])
new_client_df

In [ ]:
new_df = pd.concat([bank_df_all, new_client_df], axis = 0)
new_df